{
  "id": 25416123,
  "title": "Privacy matters even if “you have nothing to hide”",
  "points": 63,
  "user": "freddyym",
  "time": 1607947034,
  "time_ago": "2 hours ago",
  "type": "link",
  "url": "https://write.privacytools.io/freddy/why-privacy-matters-even-if-you-have-nothing-to-hide",
  "domain": "write.privacytools.io",
  "comments": [
    {
      "id": 25417165,
      "level": 0,
      "user": "inanutshellus",
      "time": 1607952143,
      "time_ago": "7 minutes ago",
      "content": "<p>I really like Social Cooling&#x27;s take on privacy.<p>SC&#x27;s take (paraphrasingly, of course) is that privacy is the right to have your past forgotten, your mistakes forgiven. Without privacy you&#x27;re rewarded for astroturfing your life, pretending a bland successful life without pot holes.<p><a href=\"http:&#x2F;&#x2F;www.socialcooling.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.socialcooling.com&#x2F;</a><p>And of course the Social Dilemma (Netflix docudrama)&#x27;s take on it -- that facebook-et-al don&#x27;t sell &quot;your data&quot; they sell &quot;a guaranteed change in your behavior&quot; -- is a pretty damn powerful message, too.<p>This website&#x27;s &quot;nobody cares but they shouuuuuld!&quot; argument is not very effective, IMHO. These guys have the right idea -- giving access to privacy tooling -- but this post should&#x27;ve been more focused on education from the get-go. e.g. &quot;We know you feel powerless about privacy. That&#x27;s why we built [x resource]. Claw control back.&quot; or something.",
      "comments": [
        {
          "id": 25417225,
          "level": 1,
          "user": "tolbish",
          "time": 1607952530,
          "time_ago": "a minute ago",
          "content": "<p>I do not think it is a given that the general public feels powerless about privacy.<p>Why would someone take steps to empower themselves if they see no need for such power?",
          "comments": []
        }
      ]
    },
    {
      "id": 25417117,
      "level": 0,
      "user": "bad_alloc",
      "time": 1607951799,
      "time_ago": "13 minutes ago",
      "content": "<p>Whenever somebody argues having nothing to hide I ask:<p>1) Where were you last night?<p>2) How much money is in your bank account? Do you have any debt?<p>3) What is your Debit Card PIN&#x2F;account password&#x2F;...<p>4) What is your address? Your families address?<p>5) Can I see your key?<p>And so on. Everybody needs to proctect themselves and potentially others attached to them. There is a good reason for these questions being awkward and inappropriate.",
      "comments": [
        {
          "id": 25417230,
          "level": 1,
          "user": "jmnicolas",
          "time": 1607952548,
          "time_ago": "a few seconds ago",
          "content": "<p>As seen in a recent comment here, you might add:<p>6) Let the toilets door open, after all we all know what you&#x27;re going to do there.",
          "comments": []
        },
        {
          "id": 25417191,
          "level": 1,
          "user": "DoubleGlazing",
          "time": 1607952309,
          "time_ago": "4 minutes ago",
          "content": "<p>I like to counter the &quot;If you have done nothing wrong then you have nothing to hide&quot; argument with...<p>&quot;If I have done nothing wrong, then no one has the need to take an interest in my personal affairs.&quot;",
          "comments": [
            {
              "id": 25417215,
              "level": 2,
              "user": "arvindamirtaa",
              "time": 1607952443,
              "time_ago": "2 minutes ago",
              "content": "<p><i></i>Sarcasm ahead<i></i><p>But we don&#x27;t know that you have done nothing wrong. Why don&#x27;t we just take a quick peek and we&#x27;ll leave you alone until we randomly decide to do this pointless exercise again?",
              "comments": []
            }
          ]
        },
        {
          "id": 25417192,
          "level": 1,
          "user": "plaxitogrip",
          "time": 1607952321,
          "time_ago": "4 minutes ago",
          "content": "<p>Right. And one notices that such people already implicitly value privacy since they talk to their husband or wife or close friend very differently depending upon whether others are present.",
          "comments": []
        },
        {
          "id": 25417135,
          "level": 1,
          "user": "newlikeice",
          "time": 1607951932,
          "time_ago": "11 minutes ago",
          "content": "<p>you hit the nail on the head.",
          "comments": []
        }
      ]
    },
    {
      "id": 25417166,
      "level": 0,
      "user": "lawn",
      "time": 1607952150,
      "time_ago": "7 minutes ago",
      "content": "<p>I&#x27;ve started to ask &quot;What about others? Don&#x27;t they have the right to privacy?&quot;.<p>For example if you&#x27;re gay you might not want everyone to find out. Or if you&#x27;re into some weird kinky stuff. Or even better if you live with a hidden identity because you&#x27;ve witnessed against organized crime.<p>It&#x27;s fine to give away your personal privacy, but it&#x27;s harder to throw other people under the buss (if you&#x27;re capable of empathy as most of us are).",
      "comments": []
    },
    {
      "id": 25417216,
      "level": 0,
      "user": "mark_l_watson",
      "time": 1607952448,
      "time_ago": "2 minutes ago",
      "content": "<p>Some people act like the war on corporate (and government) surveillance capitalism is lost.<p>I think that is the wrong attitude. Create friction by whatever means fit with your life style and work flow.<p>I do simple things like delete all cookies in all of my devices at least once a week, use the Duck Duck Go browser on iOS and iPadOS (I only use laptops for coding so I just use Safari and Firefox on my Mac and Linux laptops), disable location tracking as much as possible, and I use ProtonMail and Proton Calendar.<p>As someone once said, if you have nothing to hide, then you don’t have a life. Personally, I believe that surveillance capitalism, with creeping neoliberalism and neoconservativism pose an existential threat to any semblance of democracy. Maybe democracy is a lost cause? I don’t believe it, and I am willing to put up some fight to at least try to preserve it.",
      "comments": []
    },
    {
      "id": 25417143,
      "level": 0,
      "user": "solarhess",
      "time": 1607951965,
      "time_ago": "10 minutes ago",
      "content": "<p>We want a society that respects free will and freedom from coercion. Privacy is necessary to achieve that end. Let&#x27;s focus on achieving that end.<p>Security experts spent 2 decades arguing for privacy. Very little has changed. For most people, privacy is not an end in itself.",
      "comments": []
    },
    {
      "id": 25417227,
      "level": 0,
      "user": "_iyig",
      "time": 1607952537,
      "time_ago": "a few seconds ago",
      "content": "<p>&gt;Our privacy is eroding. [...] The war is not lost, however.<p>Steven Rambam would probably disagree. He&#x27;s a private investigator who&#x27;s given many excellent talks on privacy at Hackers On Planet Earth (HOPE):<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=FHwl6AyL6js&amp;t=10m20s\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=FHwl6AyL6js&amp;t=10m20s</a><p>Talk goes into exquisite detail on the ways in which private information is shared, sold, amalgamated, and analyzed by private and public entities, and how law enforcement uses (and abuses) these resources.",
      "comments": []
    },
    {
      "id": 25416617,
      "level": 0,
      "user": "LeviIsaac",
      "time": 1607949012,
      "time_ago": "an hour ago",
      "content": "<p>*&quot;PRIVACY&quot; IS LIKE &quot;the environment&quot; – it&#x27;s about too many things to be useful, so everybody ends up trampling it for a host of petty reasons. Leading to a world that&#x27;s degraded and hostile, and that would never have been chosen had the consequences been made clear.",
      "comments": []
    },
    {
      "id": 25417030,
      "level": 0,
      "user": "LatteLazy",
      "time": 1607951261,
      "time_ago": "22 minutes ago",
      "content": "<p>Also, everyone has something to hide.",
      "comments": [
        {
          "id": 25417151,
          "level": 1,
          "user": "freddyym",
          "time": 1607952041,
          "time_ago": "9 minutes ago",
          "content": "<p>Or, perhaps: &quot;YOU don’t get to decide that you have nothing to hide when you give up your privacy.&quot;",
          "comments": []
        }
      ]
    }
  ],
  "comments_count": 15
}
